Revit 2024 API
FramingShapeClassification Enumeration
 This enumeration is used to classify MEP Ancillary Framing shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public enum FramingShapeClassification
Visual Basic
Public Enumeration FramingShapeClassification
Visual C++
public enum class FramingShapeClassification
Members
Member name | Description
Linear
Circular
Oval
Other
See Also
Autodesk.Revit.DB Namespace